Revit 2024 API
WorksharingUtils.CheckoutElements Method
Overload List
Name | Description
CheckoutElements(Document, ICollection<ElementId>)
 Obtains ownership for the current user of as many specified elements as possible.
CheckoutElements(Document, ISet<ElementId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified elements as possible.
See Also
WorksharingUtils Class
WorksharingUtils Members
Autodesk.Revit.DB Namespace